import './Delivery.css'

import React from 'react'

export default function Delivery() {
  return (
    <div>
    <h1>Доставка</h1>
    <div className='delivery-wrapper'>
      <p className='delivery-items'>Console Rent пропонує швидку та надійну доставку орендованих консолей та ігор по всій країні. Ми прагнемо забезпечити зручність для наших клієнтів, тому пропонуємо кілька варіантів доставки:</p>

      <p className='delivery-items'>1. Швидка доставка: Оформлені замовлення доставляються протягом 1-3 робочих днів залежно від вашого місцезнаходження. Після оформлення замовлення ви отримаєте підтвердження та трекінг-номер для відстеження посилки.</p>
      
      <p className='delivery-items'>2. Самовивіз: Якщо ви знаходитеся в нашому місті або поруч із пунктом видачі, у вас є можливість самостійно забрати обладнання. Це може скоротити час отримання замовлення.</p>

      <p className='delivery-items'>3. Повернення обладнання: По завершенню терміну оренди ви можете повернути обладнання через кур&apos;єрську службу або скористатися послугою самовивозу. Обов&apos;язковою умовою є повернення консолей та ігор в оригінальній упаковці та належному стані.</p>

      <p className='delivery-items'>4. Вартість доставки: Доставка орендованого обладнання входить у вартість оренди, тому додаткових витрат для клієнта немає. Якщо ви повертаєте обладнання поштою, витрати на зворотну доставку також покриває компанія.</p>

      <p className='delivery-items'>5. Безпека та страхування: Усі замовлення страхуються на час доставки, тому ви можете бути впевнені в безпеці обладнання під час транспортування.</p>

      <p className='delivery-items'>Ми завжди намагаємося зробити процес доставки максимально зручним та швидким для наших клієнтів, щоб ви могли насолоджуватися улюбленими іграми якомога швидше.</p>
      </div>
    </div>
  )
}
