import './Refund.css'

import React from 'react'

export default function Refund() {
  return (
    <div>
      <h1>Повернення коштів</h1>
      <div className='refund-wrapper'>
      <p className='refund-items'>Console Rent дотримується чітких і прозорих правил щодо повернення коштів. Якщо ви скасуєте замовлення до моменту відправлення консолі або гри, ми гарантуємо повне повернення сплаченої суми. Після того, як обладнання вже відправлено, кошти не повертаються, окрім випадків, коли виникають технічні несправності або помилки з нашого боку.</p>

      <p className='refund-items'>Якщо під час оренди ви виявите несправність обладнання, яка не пов’язана з діями орендаря, ми забезпечимо заміну або часткове повернення коштів залежно від ситуації. У випадку технічних проблем чи невідповідності товару, будь ласка, звертайтеся до нашої служби підтримки для вирішення питання та узгодження можливого відшкодування.</p>
      </div>
    </div>
  )
}
