import './App.css';

import React from 'react';
import { HashRouter, Route, Routes } from 'react-router-dom';

import AboutUs from './components/AboutUs/AboutUs';
import Contacts from './components/Contacts/Contacts';
import Delivery from './components/Delivery/Delivery';
import Footer from './components/Footer/Footer';
import GameWithParameters from './components/Game/GameWithParameters';
import Games from './components/Games/Games';
import Header from './components/Header/Header';
import MainMenu from './components/MainMenu/MainMenu';
import Payment from './components/Payment/Payment';
import Profile from './components/Profile/Profile';
import Refund from './components/Refund/Refund';
import Register from './components/Register/Register';
import Rules from './components/Rules/Rules';

class App extends React.Component {
    constructor(properties) {
        super(properties);
        this.state = {
            orders: [],
            items: [
                {
                    id: 1,
                    name: 'PlayStation 5',
                    img: 'PlayStation5.jpg',
                    category: 'Оренда консолі',
                    price: '299',
                    title: `PlayStation 5 (PS5) — це новітня ігрова консоль від Sony, яка вражає своїми потужними технічними характеристиками та інноваційними можливостями. Вона оснащена восьмиядерним процесором AMD Ryzen на базі архітектури Zen 2 і графічним чіпом RDNA 2, що дозволяє підтримувати ігри з роздільною здатністю до 4K та частотою кадрів до 120 FPS. Також PS5 має швидкий SSD-накопичувач, що забезпечує миттєве завантаження ігрових рівнів та плавну роботу системи. Інноваційний контролер DualSense з тактильною віддачею та адаптивними тригерами додає новий рівень занурення в ігри.\n\n Консоль також підтримує зворотну сумісність із багатьма іграми для PS4, що дозволяє насолоджуватися старими хітами на новій платформі. Окрім цього, PS5 має оновлений інтерфейс та покращену систему охолодження, що робить її продуктивнішою та тихішою порівняно з попередніми версіями. Завдяки широкій бібліотеці ігор, можливостям стрімінгу та мультимедійним функціям, PlayStation 5 є ідеальним вибором для геймерів, які шукають найсучасніші технології для ігрових розваг.`,
                },
                {
                    id: 2,
                    name: 'PlayStation 4',
                    img: 'PlayStation4.jpg',
                    category: 'Оренда консолі',
                    price: '199',
                    title: `PlayStation 4 — популярна консоль від Sony, яка стала справжнім проривом у світі ігор завдяки великій бібліотеці ексклюзивних ігор. З PS4 гравці насолоджуються чудовою графікою та плавною роботою системи.\n\nКонсоль підтримує HD-формат та забезпечує захопливий геймплей завдяки інноваційним функціям, таким як Remote Play та PS Plus.`,
                },
                {
                    id: 3,
                    name: 'Xbox One S',
                    img: 'XboxOneS.jpg',
                    category: 'Оренда консолі',
                    price: '199',
                    title: `Xbox One S — це потужна ігрова консоля, яка забезпечує вражаючі можливості для геймерів усіх рівнів. З компактним дизайном і стильним білим корпусом ця консоль не лише впишеться в будь-який інтер'єр, а й дозволить насолоджуватися іграми у форматі 4K Ultra HD. Xbox One S підтримує HDR, що забезпечує яскраві кольори та вражаючу деталізацію, підвищуючи рівень занурення в гру.\n\n Завдяки великій бібліотеці ігор, від ексклюзивних проектів до популярних хітів, Xbox One S пропонує різноманітний контент для всіх смаків. Крім того, консоль має вбудований Blu-ray плеєр, що дозволяє переглядати фільми в чудовій якості. З можливістю підключення до Xbox Live, користувачі можуть насолоджуватися онлайн-іграми, завантажувати нові ігри та брати участь у різноманітних акціях. Xbox One S — це ідеальний вибір для тих, хто шукає потужну, функціональну та універсальну ігрову консоль.`,
                },
                {
                    id: 4,
                    name: 'Xbox Series X',
                    img: 'XboxSeriesX.jpg',
                    category: 'Оренда консолі',
                    price: '299',
                    title: `Xbox Series X — потужна консоль нового покоління від Microsoft, що забезпечує неймовірну швидкість і продуктивність. Завдяки SSD та підтримці до 120 FPS, ігри завантажуються миттєво, а графіка залишається плавною та високоякісною. Технологія трасування променів додає глибини освітленню та тіням, роблячи ігри ще більш реалістичними.\n\n Крім того, Xbox Series X має розширену зворотну сумісність, що дозволяє грати у понад 1000 ігор з попередніх поколінь консолей Xbox. Це робить її універсальною платформою для нових релізів та класичних хітів. Консоль підтримує роздільну здатність 4K та виводить картинку з яскравими кольорами і деталями, що підходить для сучасних телевізорів.\n\n Xbox Series X — це вибір для тих, хто шукає найвищу продуктивність та універсальність. Вона підходить як для казуальних гравців, так і для хардкорних геймерів, які цінують якість графіки та швидкість.`,
                },
                {
                    id: 5,
                    name: 'Xbox Series S',
                    img: 'XboxSeriesS.jpg',
                    category: 'Оренда консолі',
                    price: '299',
                    title: `Xbox Series S — це компактна та потужна ігрова консоль нового покоління від Microsoft, яка пропонує вражаючу продуктивність у маленькому форм-факторі. Завдяки архітектурі Xbox Velocity, консоль забезпечує блискавичні завантаження ігор та плавний геймплей, що дозволяє гравцям насолоджуватися бездоганними враженнями під час гри.\n\n Series S підтримує відтворення ігор у роздільній здатності до 1440p з можливістю масштабування до 4K, що забезпечує високу якість зображення. Консоль також підтримує технологію Ray Tracing, що додає реалістичності освітленню та тіням у ігровому середовищі. Завдяки повній сумісності з іграми для Xbox One, користувачі можуть насолоджуватися величезною бібліотекою контенту.\n\n Зручний доступ до Xbox Game Pass відкриває можливості для гравців грати в нові релізи та класичні ігри без необхідності їх купівлі. Xbox Series S — це ідеальний вибір для тих, хто прагне отримати максимальний геймерський досвід у компактному і доступному форматі.`,
                },
                {
                    id: 6,
                    name: 'Assassins Creed Odyssey',
                    img: 'Assassins-Creed-Odyssey.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Assassin's Creed Odyssey занурює гравців у давньогрецький світ, де вони можуть досліджувати широкі простори античної Греції та боротися в епічних битвах. Гравці можуть вибрати свого персонажа: Алексіоса або Кассандру, кожен із яких має унікальну історію та набір здібностей. Відтворення історичних подій та легенд, а також увага до деталей у відтворенні давньогрецької культури, додає грі глибини.\n\n Окрім захопливої сюжетної лінії, Odyssey пропонує відкритий світ, що включає різноманітні регіони з неповторною атмосферою: гори, ліси, моря та знамениті грецькі острови. Гравці можуть взяти участь у морських битвах, досліджувати храми, та взаємодіяти з персонажами, заснованими на історичних постатях. Нова система діалогів дає можливість впливати на розвиток подій, що робить кожен прохід гри унікальним.\n\n Assassin's Creed Odyssey забезпечує глибокий ігровий досвід завдяки ретельно розробленій бойовій системі, оновленій механіці ролевої гри та кінематографічному підходу до геймплею. Гра стане справжнім відкриттям для шанувальників серії та новачків, які шукають епічну пригоду в давньому світі.`,
                },
                {
                    id: 7,
                    name: 'Call of Duty 2',
                    img: 'Call-of-Duty2.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Call of Duty 2 — це культова військова шутер-гра, яка продовжує популярну серію від студії Infinity Ward. Випущена на початку 2005 року, гра переносить гравців у часи Другої світової війни, пропонуючи епічні битви на різних фронтах. Гравці зможуть взяти на себе роль солдатів з різних країн, включаючи США, Великобританію та СРСР, кожен з яких має свої унікальні місії та виклики.\n\n Call of Duty 2 вражає реалістичною графікою та захоплюючим ігровим процесом, що робить кожну битву динамічною та напруженою. Гра пропонує різноманітні режими, включаючи одиночну кампанію та багатокористувацькі бої, де гравці можуть змагатися з друзями чи іншими гравцями онлайн. Завдяки вдосконаленій системі штучного інтелекту, вороги діють більш розумно, що додає до реалістичності та викликів.\n\n Завдяки своєму впливу на жанр та численним нагородам, Call of Duty 2 залишається класикою, яка продовжує вражати нові покоління геймерів своєю захоплюючою історією та захопливим геймплеєм.`,
                },
                {
                    id: 8,
                    name: 'Dead Rising 4',
                    img: 'Dead-Rising4.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Dead Rising 4 — це захоплююча гра в жанрі екшн-ужасу, розроблена студією Capcom Vancouver, яка переносить гравців у відкритий світ, наповнений зомбі, на святковий період. Гравці знову стають улюбленим персонажем серії, журналістом Френком Вестом, який повертається до містечка Вілламетт, щоб розкрити таємниці навколо нової епідемії зомбі.\n\n Гра вражає великим ігровим світом, що дозволяє вільно досліджувати місто та знаходити численні можливості для виживання. Dead Rising 4 пропонує вдосконалену механіку створення зброї, дозволяючи гравцям комбінувати предмети, щоб створювати унікальні знаряддя для боротьби з хвилями зомбі. З новими транспортними засобами, такими як броньовані машини та різноманітні види зброї, гравці можуть насолоджуватися ще більшим хаосом під час боротьби за виживання.\n\n Крім того, гра має режим кооперативної гри, що дозволяє друзям об'єднувати свої сили для знищення зомбі. Завдяки захоплюючому сюжету, динамічному геймплею та атмосфері святкового жаху, Dead Rising 4 обіцяє стати однією з найяскравіших пригод у світі зомбі-апокаліпсису.`,
                },
                {
                    id: 9,
                    name: 'Detroit',
                    img: 'Detroit.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Detroit: Become Human — це інноваційна гра в жанрі інтерактивного кіно, розроблена студією Quantic Dream, яка занурює гравців у футуристичний світ, де штучний інтелект та андроїди стали частиною повсякденного життя. Дія відбувається у місті Детройт в 2038 році, і гравці беруть на себе роль трьох різних персонажів, кожен з яких має свої унікальні історії та рішення, що впливають на хід сюжету.\n\n Гра вражає вражаючою графікою та детальною атмосферою, що створює відчуття занурення у світ, де технології і людяність перебувають у постійному конфлікті. Гравці повинні приймати складні моральні рішення, які впливають на розвиток подій, відносини між персонажами та фінал історії. Система вибору дозволяє грати в різних стилях, що робить кожне проходження унікальним.\n\n Detroit: Become Human піднімає важливі питання про етику, свідомість і права штучного інтелекту, пропонуючи не лише захоплюючий геймплей, а й глибокий сюжет, який змушує замислитися. Завдяки своєму інтерактивному підходу та кінематографічному стилю, гра стала одним із найбільш пам'ятних проектів у світі відеоігор.`,
                },
                {
                    id: 10,
                    name: 'FarCry6',
                    img: 'Farcry6.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Far Cry 6 — це захоплююча гра в жанрі екшн-пригоди, розроблена студією Ubisoft, яка переносить гравців на вигаданий тропічний острів Яра, що нагадує Кубу. У цій частині серії гравці стають частиною повстання проти тиранічного режиму президента Антона Кастільо, якого втілив знаменитий актор Джанкарло Еспозіто. Гравці беруть на себе роль Данні Рохаса, місцевого жителя, який приєднується до партизанського руху, щоб звільнити свою країну від гніту.\n\n Гра вражає відкритим світом, що дозволяє гравцям досліджувати різноманітні ландшафти, від густих джунглів до міст і сіл. Far Cry 6 пропонує величезний арсенал зброї та можливостей для кастомізації, а також нову механіку «кастомних дій» для гравців, що дозволяє підходити до кожної місії унікальним способом. З новими транспортними засобами, включаючи мотоцикли, танки та літаки, гравці можуть швидко переміщатися між різними локаціями.\n\n Крім того, гра має цікавий сюжет, наповнений колоритними персонажами та завданнями, які підкреслюють соціальні та політичні теми. Завдяки динамічному геймплею, вражаючій графіці та можливості взаємодії з оточенням, Far Cry 6 пропонує гравцям незабутні пригоди у світі, де боротьба за свободу стає справжнім викликом.`,
                },
                {
                    id: 11,
                    name: 'FC 24',
                    img: 'FC-24.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `EA Sports FC 24 — це новий етап у популярній футбольній серії, яка продовжує традиції FIFA, пропонуючи гравцям захоплюючий футбольний досвід. Гра вражає покращеною графікою та реалістичним ігровим процесом завдяки інноваційній технології "Hypermotion", що використовує дані з реальних матчів для точнішої анімації рухів.\n\n Гравці можуть насолоджуватися різноманітними режимами, включаючи кар'єру, Ultimate Team та онлайн-змагання, з можливістю кастомізації команд, стадіонів і візуальних елементів. Величезна бібліотека клубів і збірних дозволяє створювати унікальні команди та змагатися з суперниками з усього світу.\n\n EA Sports FC 24 обіцяє бути не лише продовженням легендарної серії, а й новою главою в історії футбольних відеоігор, що відображає дух та емоції справжнього футболу.`,
                },
                {
                    id: 12,
                    name: 'Forza Horizon 5',
                    img: 'Forza-Horizon5.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Forza Horizon 5 — це захоплююча гоночна гра, розроблена студією Playground Оренда гри, яка переносить гравців у відкритий світ Мексики. Гра пропонує вражаючу графіку та детально продумані локації, включаючи піщані пляжі, джунглі та гірські райони, що дозволяє насолоджуватися красивими пейзажами під час гонок.\n\n Гравці можуть вибирати з величезного автопарку, що включає понад 500 автомобілів, кожен з яких можна налаштувати та модифікувати. Forza Horizon 5 пропонує різноманітні ігрові режими, від класичних гонок до екзотичних викликів, а також щотижневі події та сезонні зміни, які додають динаміки та новизни до ігрового процесу.\n\n Завдяки інтерактивній спільноті та можливості грати з друзями онлайн, Forza Horizon 5 обіцяє бути однією з найбільш захопливих пригод у світі гоночних ігор, де кожен гравець може знайти свій унікальний стиль гри.`,
                },
                {
                    id: 13,
                    name: 'God of War',
                    img: 'God-of-War.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `God of War переносить гравців у скандинавський світ, де Кратос, воїн-спартанець, вирушає у подорож разом із сином Атреєм. Гра пропонує новий погляд на персонажа Кратоса, показуючи його більш людяним і зосередженим на вихованні сина. Відкритий світ гри наповнений скандинавськими міфами та чудово відтвореними ландшафтами.\n\n Бойова система стала глибшою завдяки можливості комбінувати атаки та використовувати різні види зброї. Крім того, у грі з'являються нові головоломки, які гравцям потрібно вирішувати разом з Атреєм, що робить геймплей ще більш інтерактивним. Графіка та музичне оформлення також додають грі кінематографічності.\n\n God of War — це не просто бойова гра, а глибока історія про батьківство, втрати та пошук сенсу життя. Гра отримала високу оцінку від критиків і гравців, ставши одним із найбільших хітів для PlayStation 4.`,
                },
                {
                    id: 14,
                    name: 'Gran Turismo 7',
                    img: 'Gran-Turismo7.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Gran Turismo 7 — це новий етап легендарної серії гоночних симуляторів, розроблений студією Polyphony Digital, який забезпечує гравців неймовірно реалістичним досвідом водіння. Гра пропонує великий вибір автомобілів, від класичних моделей до сучасних суперкарів, кожен з яких можна детально налаштувати та модифікувати.\n\n Серед нововведень — вдосконалена фізика водіння та реалістичні погодні умови, що роблять гонки ще більш захоплюючими та непередбачуваними. Gran Turismo 7 також пропонує різноманітні режими гри, включаючи одиночну кампанію, онлайн-гонки та заходи в автосалонах, які дозволяють гравцям змагатися з іншими гонщиками по всьому світу.\n\n Завдяки приголомшливій графіці та увазі до деталей, Gran Turismo 7 стає ідеальним вибором для фанатів автоспорту та тих, хто прагне зануритися у світ реалістичних гонок.`,
                },
                {
                    id: 15,
                    name: 'Grand Theft Auto V',
                    img: 'Grand-Theft-Auto5.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Grand Theft Auto V — це епічна гра в жанрі відкритого світу, розроблена студією Rockstar Оренда гри, яка занурює гравців у вигадане місто Лос-Сантос, натхненне Лос-Анджелесом. Гравці можуть досліджувати величезний відкритий світ, наповнений життям, від заповнених людьми вулиць до безкрайніх природних ландшафтів, у яких можна вести життя злочинця.\n\n Гра слідує історії трьох гравців: Майкла, Тревора та Франкліна, кожен з яких має свої унікальні навички та мотивації. Гравці можуть перемикатися між персонажами, виконуючи різноманітні місії, що включають пограбування, гонки, перестрілки та інші злочинні дії. Завдяки складному сюжету та можливості вибору, кожне проходження гри стає унікальним.\n\n Grand Theft Auto V також пропонує багатокористувацький режим GTA Online, де гравці можуть змагатися в різноманітних активностях, від гонок до великих пограбувань. Завдяки безмежним можливостям для кастомізації та взаємодії з іншими гравцями, GTA V залишається однією з найпопулярніших ігор усіх часів.`,
                },
                {
                    id: 16,
                    name: 'Hogwarts Legacy',
                    img: 'Hogwarts-Legacy.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Hogwarts Legacy — це захоплююча рольова гра в відкритому світі, розроблена студією Portkey Оренда гри, що переносить гравців у всесвіт Гаррі Поттера в 1800-х роках. Гравці мають можливість стати учнем Гогвортса, де можуть відвідувати уроки магії, досліджувати знаменитий замок і знайомитися з його таємницями.\n\n Гра пропонує широкий вибір кастомізації персонажа, включаючи можливість обирати будинок, що вплине на сюжет і взаємодію з іншими персонажами. Гравці можуть навчатися різноманітним магічним навичкам, вивчати заклинання та займатися алхімією, досліджуючи чудові локації, такі як забуті ліси і таємничі печери.\n\n Hogwarts Legacy також включає в себе елементи бойової системи, що дозволяє гравцям боротися з ворогами, використовуючи магію та стратегію. Завдяки насиченому сюжету та детально продуманому світу, гра обіцяє стати незабутньою пригодою для фанатів магії та всесвіту Гаррі Поттера.`,
                },
                {
                    id: 17,
                    name: 'Mafia 3',
                    img: 'Mafia3.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Mafia III — це захоплюча гра в жанрі екшену та пригод, розроблена студією Hangar 13, яка переносить гравців у відкритий світ В’єтнамської війни та кримінального підпілля 1960-х років у вигаданому місті Нью-Бордо. Гравці виступають у ролі Лінкольна Клейа, ветерана війни, який повертається додому, щоб помститися за загибель свого сімейства від рук мафії.\n\n Гра вражає атмосферою епохи, з детальною графікою та саундтреком, що підкреслює дух часу. Лінколну доведеться об'єднати сили з іншими персонажами, щоб розробити стратегію боротьби з мафією та відновити контроль над містом. Система вибору дозволяє гравцям підходити до місій у різний спосіб, від тихого проходження до відкритих перестрілок.\n\n Mafia III також пропонує різноманітні активності поза основною сюжетною лінією, включаючи побічні завдання, гонки та дослідження міста. Завдяки глибокій історії та емоційним моментам, гра стає не лише екшеном, а й дослідженням теми сім'ї, зради та помсти.`,
                },
                {
                    id: 18,
                    name: 'Overwatch',
                    img: 'Overwatch.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Overwatch — це багатокористувацька командна гра в жанрі шутера від першої особи, розроблена студією Blizzard Entertainment. Гравці обирають з різноманітного складу героїв, кожен з яких має унікальні здібності та ролі, такі як танки, підтримка та атакуючі персонажі. Це забезпечує динамічний ігровий процес, де стратегія та командна робота є ключовими для успіху.\n\n Гра пропонує різні режими, включаючи захоплення об'єктів, супроводження вантажу та захист бази. Яскрава графіка та стилізований дизайн персонажів роблять Overwatch візуально привабливою, а різноманітні карти, натхнені культурою та архітектурою з усього світу, додають атмосферності.\n\n Overwatch також має активну спільноту та регулярні оновлення, які включають нових героїв, події та зміни у балансі гри. Завдяки своїй доступності та глибокій механіці, гра стала однією з найпопулярніших у жанрі командних шутерів, залучаючи гравців з усього світу.`,
                },
                {
                    id: 19,
                    name: 'Red Dead Redemption 2',
                    img: 'Red-Dead-Redemption2.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Red Dead Redemption 2 — це вестерн у відкритому світі від студії Rockstar, який переносить гравців у захопливий світ дикого заходу. Гравці беруть на себе роль Артура Моргана, члена банди Ван дер Лінде, що бореться за виживання у світі, де зміна порядків та індустріалізація залишають мало місця для свободи. Гра відзначається глибоким сюжетом, де кожен вибір має свої наслідки, а персонажі мають багатий внутрішній світ.\n\n Світ Red Dead Redemption 2 надзвичайно деталізований, з різноманітними локаціями: від густих лісів до безкраїх прерій, від снігових вершин до теплих луків. Гравці можуть полювати, рибалити, виконувати побічні місії та брати участь у численних пригодах, що робить кожен момент у грі насиченим. Крім того, система взаємодії з NPC дозволяє будувати стосунки з іншими персонажами, що додає реалізму.\n\n Red Dead Redemption 2 пропонує унікальний досвід для любителів вестернів та рольових ігор. Кінематографічний підхід до геймплею, прекрасна графіка та захопливий світ роблять цю гру одним із шедеврів у світі відеоігор.`,
                },
                {
                    id: 20,
                    name: 'Sekiro',
                    img: 'Sekiro.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Sekiro: Shadows Die Twice — це екшн-ролева гра, розроблена студією FromSoftware, яка пропонує гравцям унікальний досвід у світі феодальної Японії. У центрі сюжету — воїн на ім’я Вовк, який намагається врятувати свого господаря і помститися ворогам, що знищили його клан. Гра поєднує в собі елементи стелсу, бойових мистецтв і відкритого світу, створюючи захопливу атмосферу.\n\n Sekiro вражає своєю механікою бою, яка акцентує увагу на точності, швидкості та стратегії. Гравці повинні вміло використовувати парирування, ухилення та різноманітні бойові прийоми, щоб перемагати ворогів, кожен з яких має свої унікальні атаки та слабкості. Також у грі присутня система прокачування, що дозволяє гравцям налаштовувати навички Вовка відповідно до свого стилю гри.\n\n Завдяки вражаючій графіці, захоплюючій історії та складним боссам, Sekiro: Shadows Die Twice стала критично визнаною грою, отримавши безліч нагород і визнання за свій інноваційний підхід до жанру екшн-ігор.`,
                },
                {
                    id: 21,
                    name: 'Spider Man 2',
                    img: 'Spider-Man2.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Spider-Man 2 — це ексклюзивна гра для PlayStation 5 від студії Insomniac Оренда гри, яка продовжує історію популярної серії про супергероя Пітера Паркера. У цій частині гравці можуть керувати не лише Пітером Паркером, а й Майлзом Моралесом, кожен із яких має свої унікальні здібності та бойовий стиль. Гра вражає неймовірною графікою завдяки потужностям PS5: відкритий світ Нью-Йорка виглядає реалістично, зокрема завдяки деталізованим будівлям, динамічним погодним умовам та плавній зміні дня і ночі.\n\n
                    У Spider-Man 2 представлено нові механіки пересування, включаючи політ на павутині та швидкі комбо-атаки. Гравців також чекає цікава сюжетна лінія, яка поєднує особисті драми героїв з новими загрозами від відомих лиходіїв, зокрема Венома. Завдяки глибокому геймплею,кінематографічним моментам та інтерактивним битвам, гра Spider-Man 2 обіцяє бути однією з найбільш захопливих пригод у світі супергероїв.`,
                },
                {
                    id: 22,
                    name: 'Tekken 8',
                    img: 'Tekken8.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `Tekken 8 — це наступна частина знаменитої серії бойових ігор, розроблена компанією Bandai Namco Entertainment. Гра обіцяє вражаючу графіку завдяки новому ігровому движку, який підкреслює деталі персонажів та бойові арени. У Tekken 8 гравці знову зможуть насолоджуватися улюбленими персонажами, а також новими бійцями, що додає свіжості та різноманітності до ігрового процесу.\n\n Гра зберігає класичну механіку серії, пропонуючи гравцям динамічні бої та інтуїтивно зрозумілі комбінації атак. Tekken 8 вводить нові елементи, такі як вдосконалені спеціальні рухи та система "Heat", що дозволяє збільшувати агресію та посилювати атаки під час бою, створюючи ще більше стратегічних можливостей.\n\n Крім того, гра пропонує як одиночний режим, так і багатокористувацькі бої, що дозволяє гравцям змагатися з друзями та суперниками з усього світу. Завдяки емоційній історії та епічним битвам, Tekken 8 обіцяє стати однією з найочікуваніших ігор у жанрі бойових мистецтв.`,
                },
                {
                    id: 23,
                    name: 'The Last of Us pt.1',
                    img: 'The-Last-of-us.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `The Last of Us Part I — це переосмислення культової гри від студії Naughty Dog, що переносить гравців у постапокаліптичний світ, де людство бореться за виживання в умовах епідемії гриба, що перетворює людей на монстрів. Гравці слідують за Джоелом та Еллі, двома героями, які намагаються пройти через небезпечні території, зустрічаючи як небезпечних ворогів, так і інших виживших.\n\n Гра вражає покращеною графікою, деталізацією персонажів і новими анімаціями, які роблять емоційний контент ще більш захоплюючим. Інтуїтивна бойова система, механіки стелсу та дослідження створюють насичений ігровий процес, який підкреслює атмосферу страху і безнадії.\n\n The Last of Us Part I також включає в себе вдосконалене управління та нові ігрові механіки, що роблять гру ще більш динамічною. Завдяки глибокій історії, емоційним моментам і безкомпромісній графіці, ця гра є справжнім шедевром, який порадує як нових гравців, так і фанатів оригіналу.`,
                },
                {
                    id: 24,
                    name: 'The Sims 4',
                    img: 'The-Sims4.png',
                    category: 'Оренда гри',
                    price: '149',
                    title: `The Sims 4 — це популярна симуляційна гра, розроблена компанією Maxis і видана Electronic Arts, яка дозволяє гравцям створювати і управляти життям віртуальних персонажів, відомих як Сіми. Гравці мають можливість налаштовувати вигляд, характер і стиль життя своїх персонажів, а також будувати і декорувати їхні домівки.\n\n Гра пропонує широкий спектр можливостей для взаємодії між персонажами, включаючи дружбу, романтичні стосунки та кар'єрні досягнення. The Sims 4 також містить різноманітні розширення, що додають нові світи, об'єкти та ігрові механіки, які дозволяють гравцям досліджувати різні аспекти життя Сімів.\n\n Завдяки яскравій графіці, детальному дизайну та активній спільноті, The Sims 4 продовжує залучати гравців, пропонуючи нескінченні можливості для творчості та експериментів у віртуальному світі.`,
                },
                {
                    id: 25,
                    name: 'UFC 5',
                    img: 'UFC5.jpg',
                    category: 'Оренда гри',
                    price: '149',
                    title: `UFC 5 — це нова частина популярної серії спортивних ігор, розроблена компанією EA Sports, що пропонує гравцям можливість зануритися у світ змішаних бойових мистецтв. Гра має вдосконалену графіку та анімації, які створюють реалістичний досвід бою, дозволяючи гравцям відчути всі нюанси MMA, від ударної техніки до греплінгу.\n\n UFC 5 вводить нові механіки бойової системи, що роблять поєдинки ще більш динамічними та стратегічними. Гравці можуть вибирати з величезного списку реальних бійців, а також створювати власних персонажів, налаштовуючи їх зовнішність, навички та стиль бою. У грі також представлено покращене управління, що дозволяє легше виконувати комбінації атак і захисту.\n\n Крім того, UFC 5 пропонує різноманітні режими, включаючи кар'єру, онлайн-матчі та поєдинки з друзями, що робить її ідеальним вибором як для новачків, так і для досвідчених фанатів змішаних бойових мистецтв. Завдяки глибокій механіці та реалістичному підходу, UFC 5 обіцяє стати однією з найцікавіших спортивних ігор цього року.`,
                },
            ],
        };
        this.addToOrder = this.addToOrder.bind(this);
        this.deleteOrder = this.deleteOrder.bind(this);
    }
    render() {
        return (
            <div>
                <HashRouter>
                    <Header orders={this.state.orders} onDelete={this.deleteOrder} />
                    <Routes>
                        <Route path="/games" element={<Games />} />
                        <Route path="/profile" element={<Profile />} />
                        <Route path="/" element={<MainMenu />} />
                        <Route
                            path="/game/:elementId"
                            element={<GameWithParameters onAdd={this.addToOrder} items={this.state.items} />}
                        />
                        <Route path="/mainmenu" element={<MainMenu />} />
                        <Route path="/contacts" element={<Contacts />} />
                        <Route path="/aboutus" element={<AboutUs />} />
                        <Route path="/rules" element={<Rules />} />
                        <Route path="/delivery" element={<Delivery />} />
                        <Route path="/payment" element={<Payment />} />
                        <Route path="/refund" element={<Refund />} />
                        <Route path="/register" element={<Register />} />
                    </Routes>
                    <Footer />
                </HashRouter>
            </div>
        );
    }

    deleteOrder(id) {
        this.setState({ orders: this.state.orders.filter((element) => element.id !== id) });
    }

    addToOrder(item) {
        let isInArray = false;

        for (const element of this.state.orders) {
            if (element.id === item.id) isInArray = true;
        }
        if (!isInArray) this.setState({ orders: [...this.state.orders, item] });
    }
}
export default App;
