import './Payment.css'

import React from 'react'

export default function Payment() {
  return (
    <div>
      <h1>Оплата</h1>
    <div className='payment-wrapper'>
      <p className='payment-items'>Console Rent пропонує гнучкі та зручні варіанти оплати для оренди ігрових консолей та ігор. Ми прагнемо зробити процес оплати простим та прозорим для кожного клієнта:</p>

      <p className='payment-items'>1. Способи оплати: Ви можете здійснити оплату за допомогою банківської картки (Visa, MasterCard), електронних платіжних систем або через банківський переказ. Всі транзакції здійснюються через захищені платіжні системи, що гарантує безпеку ваших даних.</p>

      <p className='payment-items'>2. Передоплата: Оренда обладнання передбачає 100% передоплату за весь термін оренди, що вибирається під час оформлення замовлення. Тільки після підтвердження оплати замовлення буде відправлено на доставку.</p>

      <p className='payment-items'>3. Депозит: При оренді консолей і деяких дорогих аксесуарів вноситься заставна сума (депозит), яка повертається після завершення терміну оренди та перевірки обладнання на справність і цілісність.</p>

      <p className='payment-items'>4. Продовження оренди: Якщо ви бажаєте продовжити термін оренди, оплату за додаткові дні необхідно внести до закінчення початкового періоду оренди. Ви можете легко зробити це через особистий кабінет на сайті.</p>

      <p className='payment-items'>5. Повернення коштів: У разі відмови від оренди до моменту відправлення обладнання ви маєте право на повне повернення сплаченої суми. Після відправлення обладнання повернення коштів не передбачене, але можливе часткове повернення у випадку технічних несправностей або помилок з нашого боку.</p>

      <p className='payment-items'>6. Додаткові послуги: Деякі послуги, такі як експрес-доставка або страхування обладнання на випадок пошкоджень, можуть потребувати додаткової оплати. Всі ці послуги будуть відображені в загальному рахунку при оформленні замовлення.</p>

      <p className='payment-items'>Ми прагнемо забезпечити прозорість та легкість в оплаті, щоб ви могли без зайвих клопотів насолоджуватися нашими консолями та іграми.</p>
      </div>
    </div>
  )
}
