import './Rules.css'

import React from 'react'

export default function Rules() {
  return (
    <div>
      <h1> Правила </h1>
      <div className='rules-wrapper'>
        
      <p className='rules-items'>Оренда ігрового обладнання:</p>

      <p className='rules-items'>1. Орендувати консолі та ігри може будь-який користувач, який досягнув 16 років. Для оформлення замовлення необхідно зареєструватися на сайті та підтвердити свою особу.</p>

      <p className='rules-items'>2. Термін оренди: Ми пропонуємо кілька варіантів оренди — від 1 днів до 30   	днів з можливістю продовження. Якщо ви бажаєте продовжити оренду, необхідно зв&apos;язатися з нами заздалегідь.</p>

      <p className='rules-items'>3. Доставка та повернення: Ми забезпечуємо швидку доставку по вьому Ужгороду. Повернення обладнання має бути здійснене в оригінальній упаковці та в тому ж стані, в якому було отримано</p>

      <p className='rules-items'>4. Гарантія та технічна підтримка: На час оренди надається гарантія на справність обладнання. У разі виникнення технічних проблем або поломок, будь ласка, зверніться в службу підтримки. Вартість ремонту несправностей, які виникли не з вини користувача, покриває компанія.</p>

      <p className='rules-items'>5. Відповідальність орендаря: Клієнт несе повну відповідальність за цілісність і справність орендованого обладнання. У разі пошкодження або втрати консолі чи ігор орендар зобов&apos;язується компенсувати збитки згідно з оцінкою вартості ремонту або заміни.</p>

      <p className='rules-items'>6. Повернення депозиту: При оренді обладнання вноситься заставна сума, яка повертається після перевірки техніки на цілісність та справність.</p>

      <p className='rules-items'>7. Використання обладнання: Орендоване обладнання повинно використовуватись виключно за призначенням. Будь-яке несанкціоноване втручання у систему (модифікації, зломи) заборонене і може призвести до анулювання договору оренди та вимоги компенсації.</p>

      <p className='rules-items'>8. Заборона перепродажу: Орендовані консолі та ігри заборонено передавати третім особам або перепродавати під час оренди. Всі права на обладнання залишаються за Console Rent.</p>
      </div>
      </div>
  )
}
